bs3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 18:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bookshelf 3: Philosophy, CS, etc</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bookshelf 3: Philosophy, CS, etc</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5d0d847">1. Philosophy</a></li>
<li><a href="#org0648757">2. CS</a></li>
<li><a href="#orgc6c973f">3. Others</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5d0d847" class="outline-2">
<h2 id="org5d0d847"><span class="section-number-2">1.</span> Philosophy</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="all">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Kalish, Montaguem, Mar</td>
<td class="org-left">Logic: Techniques of Formal Reasoning 2e</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Garfield, Kiteley</td>
<td class="org-left">Meaning and Truth</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Michael Dummett</td>
<td class="org-left">Frege and other Philosophers</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Kurt Gödel</td>
<td class="org-left">Travaux de Logique (Work of Logic)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Arnauld, Nicole</td>
<td class="org-left">La Logique ou l'art de penser (Logic; or the art of thinking)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Venn</td>
<td class="org-left">Symbolic Logic</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Sachs</td>
<td class="org-left">Aristotle Poetics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Robert Neidorf</td>
<td class="org-left">Deductive Forms</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Langer</td>
<td class="org-left">an introduction to Symbolic Logic</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Kripke</td>
<td class="org-left">Naming and Necessity</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Boole</td>
<td class="org-left">The Laws of Thought</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nick Bostrom</td>
<td class="org-left">Superintelligence</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nick Bostrom</td>
<td class="org-left">Superintelligence</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">René Descartes</td>
<td class="org-left">Oeuvres philosophiques (1618-1637) (French)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Carnap</td>
<td class="org-left">Logical Syntax of Language</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lyons</td>
<td class="org-left">Semantics 1, 2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Smith, Smith</td>
<td class="org-left">The Cambridge Companion to Husserl</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Kit Fine</td>
<td class="org-left">Reasoning With Arbitrary Objects</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">WV Quine</td>
<td class="org-left">The Ways of Paradox and other essays</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FH Bradley</td>
<td class="org-left">Writings on Logic and Metaphysics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GE Moore</td>
<td class="org-left">Principia Ethica</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Augustus de Morgan</td>
<td class="org-left">On the Syllologism and Other Logical Writings</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">David C Linberg</td>
<td class="org-left">Theories of Vision: from Al-Kindi to Kepler</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wilson</td>
<td class="org-left">The Invisible World</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lynn Picknett, Clive Prince</td>
<td class="org-left">The Templar Revelation</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Dummett</td>
<td class="org-left">Truth and other enigmas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Stewart Shapiro</td>
<td class="org-left">The Limits of Logic</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nagel, Suppes, Tarski</td>
<td class="org-left">Logic, Methodology and Philosophy of Science</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Immanuel Kant</td>
<td class="org-left">Prolegomena to Any Future Metaphysics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Albert Einstein</td>
<td class="org-left">Ideas and Opinions</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0648757" class="outline-2">
<h2 id="org0648757"><span class="section-number-2">2.</span> CS</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="all">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Dromey</td>
<td class="org-left">How to Solve it by Computer</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Narasimha Karumanchi</td>
<td class="org-left">Data Structures and Algorithms Made Easy</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Byron Gottfried</td>
<td class="org-left">Schaum's outlines - Programming with C - 2nd edition</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Langsam, Augenstein, Tenenbaum</td>
<td class="org-left">Data Structures using C and C++</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Thiagarajan</td>
<td class="org-left">National Seminar on Theoritical Computer Science</td>
<td class="org-left">2 of these</td>
</tr>

<tr>
<td class="org-left">Aho, Lam, Sethi, Ullman</td>
<td class="org-left">Compilers: Principles, Techniques and Tools</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Keith D. Cooper, Linda Torczon</td>
<td class="org-left">Engineering a Compiler</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Cormen, Leiserson, Rivest, Stein</td>
<td class="org-left">Introductin to Algorithms</td>
<td class="org-left">CLRS, CRLS</td>
</tr>

<tr>
<td class="org-left">Yashavant Kanetkar</td>
<td class="org-left">Let us C - 3rd edition</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Horstmann</td>
<td class="org-left">Core Java: Volume I - Fundamentals</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Dasgupta, Papadimitriou, Vazirani</td>
<td class="org-left">Algorithms</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lala</td>
<td class="org-left">Quantum Computing: A Beginner's Introduction</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Micheal Sipser</td>
<td class="org-left">Theory of Computation</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Linz</td>
<td class="org-left">An Introduction to Formal Languages and Automata 4e</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hopcroft, Motwani, Ullman</td>
<td class="org-left">Introduction to Automata Theory, Languages, and Computation</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Richard Bird</td>
<td class="org-left">Introduction to Functional Programming using Haskell 2e</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Hennessy, Patterson</td>
<td class="org-left">Computer Architecture: A Quantitative Approach</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mark Lutz, David Ascher</td>
<td class="org-left">Python 2e by O'Reilly</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Cassandras, Lafortune</td>
<td class="org-left">Introcution to Discrete Event Systems</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Imre Csiszar, Janos Korner</td>
<td class="org-left">Information Theory</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Gerald Farin</td>
<td class="org-left">Curves and Surfaces for Computer Aided Geometric Design</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">few printed sections from books</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc6c973f" class="outline-2">
<h2 id="orgc6c973f"><span class="section-number-2">3.</span> Others</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="all">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Margulis Schwartz</td>
<td class="org-left">Five Kingdoms: An Illustrated Guide to the Phyla of Life on Earth</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Amber Habib</td>
<td class="org-left">The Calculus of Finance</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Eswae S. Prasad</td>
<td class="org-left">The Future of Money</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a few GRE books</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">"arihant" books</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HC Verma</td>
<td class="org-left">Concepts of Physics 1, 2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Parasuraman</td>
<td class="org-left">Going to America</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a couple TOEFL books</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Vincent Persichetti</td>
<td class="org-left">20th Century Harmony: Creative Aspects and Practice</td>
<td class="org-left">2 copies</td>
</tr>

<tr>
<td class="org-left">Andrew Marr</td>
<td class="org-left">All about Politics</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-11-23 Sat 18:29</p>
</div>
</body>
</html>
